export const PRIVACY_POLICY = `《来了么到岗助手》用户政策和隐私协议

《来了么到岗助手》用户服务协议及隐私政策
更新日期：2026 年 1 月 生效日期：2026 年 1 月

欢迎使用 来了么到岗助手（以下简称“本小程序”）。 我们非常重视用户的个人信息和隐私保护。本政策将向您说明我们如何收集、使用、存储您的个人信息，以及您所享有的相关权利。在您使用前，请仔细阅读并充分理解本政策。您点击同意或开始使用，即表示您已理解并同意本政策的全部内容。

一、 我们如何收集和使用您的信息
为了向您提供核心办公辅助功能，我们会在遵循最小必要原则的基础上，收集以下信息：

微信基础信息（授权登录） 经您明确授权，我们会获取您的微信昵称、头像。

用途：用于标识用户身份，在到岗记录、团队排行榜及个人页面中展示。

相册与文件访问权限（自定义头像） 当您选择更新个人头像或上传图片时，我们会请求访问您的相册/相机权限。

用途：仅用于获取您主动选择的图片进行头像设置，我们不会主动扫描您的相册或获取其他无关照片。

剪贴板读取功能（团队快捷加入） 当您从其他应用复制团队邀请码并返回本小程序时，我们可能会读取剪贴板内容。

用途：用于识别邀请码并实现“快捷粘贴”或“自动弹窗加入团队”功能。剪贴板数据仅在本地识别，不会上传至服务器进行与此功能无关的存储。

微信运动步数（团队轻激励） 当您主动开启“微信步数”功能并授权后，我们会获取您最近的微信运动步数汇总数据。

用途：用于展示个人今日步数、本周累计步数、团队步数挑战进度及排行榜。我们仅保存按天汇总的步数结果，不采集位置轨迹。您可以随时关闭同步或关闭团队展示。

到岗计算相关业务数据 在您使用核心功能时，我们会记录：

到岗日期、到岗类型（如到岗、远程、请假、出差等）。

统计结果（如到岗天数、周期汇总、团队趋势等）。

用途：为您及您的团队提供到岗计算和历史统计报表服务。

二、 信息的存储与安全
存储位置：您的个人信息和业务数据将安全存储在 腾讯云开发（CloudBase） 提供的云数据库中。

安全保障：

数据仅与您的微信唯一标识（OpenID）关联，具备极高的隔离性。

我们采用行业标准的安全技术措施防止数据泄露、滥用、未经授权的访问或披露。

三、 信息的共享与披露
我们郑重承诺：我们不会将您的个人信息出售、出租或共享给任何第三方，除非：

获得您的明确同意或授权。

为执行法律法规、司法裁定或监管机构的要求。

为维护您或公众的生命财产安全等合法权益。

四、 您的权利
您对个人信息拥有充分的控制权：

查看与更正：您可以在个人中心随时修改头像、昵称并查阅历史记录。

撤回授权：您可以随时在微信设置中撤回对相册、用户信息等权限的授权。

数据删除：如您希望注销账号或删除全部历史数据，可通过“联系开发者”提交申请，我们将在核实后 7 个工作日内完成处理。

五、 未成年人保护
本小程序主要面向职场及办公场景。若您是未满 18 周岁的未成年人，请在监护人指导下阅读本政策并使用。

六、 政策更新
随着产品功能的升级，我们可能会适时修订本政策。实质性变更发生时，我们将在小程序显眼位置发布公告或弹窗提醒。

七、 联系我们
如您对本政策有任何疑问、建议或投诉，欢迎通过以下方式与我们取得联系：

官方邮箱：ws4715535@foxmail.com

感谢您信任「来了么到岗助手」，我们将竭诚保护您的数据安全！`
